{
    "biodata":{

        "personal_info":{
        "name":"Virat Kohli",
        "born":"5 november 1988",
        "age":33,
        "nickname":"Cheeku",
        "height":"5 ft 9 in",
        "batting":"right handed",
        "bowling":"right arm medium",
        "role":"top order batsman"
        },

        "international_info":{
            "nationality":"Indian",
            "test_debut":"20 June 2011",
            "last_test":"12 March 2022",
            "last_odi":"11 February 2022",
            "odi_shirt_no":18
        }    
    },
    "introduction":"Virat Kohli born 5 November 1988 is an Indian international cricketer and former captain of the India national cricket team. He plays for Delhi in domestic cricket and Royal Challengers Bangalore in the Indian Premier League as a right-handed batsman. He is often considered one of the best batsmen of his era and some critics believe him to be one of the best limited-overs batsmen in history.[3] Between 2013 and 2022, he captained the India cricket team in 213 matches across all three formats. With 40 wins out of 68 matches, though mostly winning at home, Kohli is one of the most successful Indian Test captains[4] Kohli made his Test debut in 2011.[5] He reached the number one spot in the ICC rankings for ODI batsmen for the first time in 2013.[6] He has won Man of the Tournament twice at the ICC World Twenty20 (in 2014 and 2016). He also holds the world record of being the fastest to 23,000 international runs.[7]",
    "content_list":[

        {
            "title":"Early Life",
            "content":"Virat Kohli was born on 5 November 1988 in New Delhi into a Punjabi Hindu family.[15] His father, Prem Kohli, worked as a criminal lawyer and his mother, Saroj Kohli, is a homemaker.[16][17] He has an older brother, Vikash, and an older sister, Bhavna.Kohli was raised in Uttam Nagar[19] and started his schooling at Vishal Bharti Public School.[16][20] In 1998, the West Delhi Cricket Academy was created and a nine-year-old Kohli was part of its first intake.[19] Kohli trained at the academy under Rajkumar Sharma[17] and also played matches at the Sumeet Dogra Academy at Vasundhara Enclave at the same time.[19] In ninth grade, he shifted to Saviour Convent in Paschim Vihar to help his cricket practice.[16][21] His family lived in Meera Bagh until 2015 when they moved to Gurgaon.Kohli's father died on 18 December 2006 due to a stroke after being bed-ridden for a month.[16]"
        },
        {
            "title":"Youth and domestic career",
            "content":[
                {
                    "sub_title":"Delhi",
                    "content":"Kohli first played for Delhi Under-15 team in October 2002 in the 2002–03 Polly Umrigar Trophy. He became the captain of the team for the 2003–04 Polly Umrigar Trophy. In late 2004, he was selected in the Delhi Under-17 team for the 2003–04 Vijay Merchant Trophy. Delhi Under-17s won the 2004–05 Vijay Merchant Trophy in which Kohli finished as the highest run-scorer with 757 runs from 7 matches with two centuries.[23] In February 2006, he made his List A debut for Delhi against Services but did not get to bat.Kohli made his first-class debut for Delhi against Tamil Nadu[25] in November 2006, at the age of 18, he scored 10 runs in his debut innings.[26] He came into the spotlight in December when he decided to play for his team against Karnataka on the day after his father's death and went on to score 90.[27] He went directly to the funeral after he got out in the match. He scored a total of 257 runs from 6 matches at an average of 36.71 in that season.[28]"
                },
                {
                    "sub_title":"India Under-19",
                    "content":"In July 2006, Kohli was selected in the India Under-19 squad on its tour of England. He averaged 105 in the three-match ODI series against England Under-19s[29] and 49 in the three-match Test series.[30] India Under-19 went on to win both the series. In September, the India Under-19 team toured Pakistan. Kohli averaged 58 in the Test series[31] and 41.66 in the ODI series against Pakistan Under-19s.In April 2007, he made his Twenty20 debut[33] and finished as the highest run-getter for his team in the Inter-State T20 Championship with 179 runs at an average of 35.80.[34] In July–August 2007, the India Under-19 team toured Sri Lanka. In the triangular series against Sri Lanka Under-19s and Bangladesh Under-19s, Kohli was the second highest run-getter with 146 runs at an average of 29 from 5 matches.[35][36] In the two-match Test series that followed, he scored 244 runs at an average of 122 including a century and a fifty. In February–March 2008, Kohli captained the victorious Indian team at the 2008 Under-19 Cricket World Cup held in Malaysia. Batting at number 3, he scored 235 runs in 6 matches at an average of 47 and finished as the tournament's third-highest run-getter and one of the three batsmen to score a hundred in the tournament.[38][39] He has helped India in a three-wicket semi-final win over New Zealand Under-19s by taking 2 wickets and scoring 43 runs in the run-chase and was awarded the man of the match.In June 2008, Kohli and his Under-19 teammates Pradeep Sangwan and Tanmay Srivastava were awarded the Border-Gavaskar scholarship. The scholarship allowed the three players to train for six weeks at Cricket Australia's Centre of Excellence in Brisbane.[39] He was also picked in the India Emerging Players squad for the four-team Emerging Players Tournament and scored 206 runs in six matches at an average of 41.20.[42]"
                }
            ]
        
        },
        {
            "title":"International career",
            "content":[
                {
                    "sub_title":"Early years",
                    "content":"n August 2008, Kohli was included in the Indian ODI squad for tour of Sri Lanka and the Champions Trophy in Pakistan. Prior to the Sri Lankan tour, Kohli had played only eight List A matches.[43] So, his selection was called a surprise call-up.[44] During the Sri Lankan tour, as both first-choice openers Sachin Tendulkar and Virender Sehwag were injured, Kohli batted as a makeshift opener throughout the series.[45] He made his international debut, at the age of 19, in the first ODI of the tour and was dismissed for 12.[46] He made his first ODI half century, a score of 54, in the fourth match.[46] He had scores of 37, 25 and 31 in the other three matches.[46] India won the series 3–2 which was India's first ODI series win against Sri Lanka in Sri Lanka"
                },
                {
                    "sub_title":"Rise through the ranks",
                    "content":"Raina was named captain and Kohli vice-captain for the tri-series against Sri Lanka and Zimbabwe in Zimbabwe in May,June 2010, as many first-choice players skipped the tour.[73] Kohli made 168 runs at an average of 42.00 including two fifties,[74] but India suffered three defeats in four matches and crashed out of the series. During the series, Kohli became the fastest Indian batsman to reach 1,000 runs in ODI cricket.[75] He made his T20I debut against Zimbabwe at Harare and scored an unbeaten 26.[76] Later that month, Kohli batted at 3 in an Indian team throughout the 2010 Asia Cup and scored a total of 67 runs at an average of 16.75.[77] His struggles with form continued in the tri-series against Sri Lanka and New Zealand in Sri Lanka where he averaged 15."
                },
                {
                    "sub_title":"Consistent performance in limited overs",
                    "content":"When India toured the West Indies in June–July 2011, they selected a largely inexperienced squad, resting Tendulkar and others such as- Gambhir and Sehwag missing out due to injuries. Kohli was one of three uncapped players in the Test squad.[92] He found success in the ODI series which India won 3–2, with a total of 199 runs at an average of 39.80.[93] His best efforts came in the second ODI at Port of Spain where he won the man of the match for his score of 81 which gave India a seven-wicket victory,[94] and the fifth ODI at Kingston where his innings of 94 came in a seven-wicket defeat.[46] Kohli made his Test debut at Kingston in the first match of the Test series that followed. He batted at 5 and was dismissed for 4 and 15 caught behind off the bowling of Fidel Edwards in both innings.[95] India went on to win the Test series 1–0 but Kohli amassed just 76 runs from five innings,[96] struggling against the short ball[97] and was particularly troubled by the fast bowling of Edwards, who dismissed him three times in the series."
                },
                {
                    "sub_title":"Setting records",
                    "content":"Kohli stood-in as the captain for the first ODI of the triangular series in the West Indies after Dhoni injured himself during the match. India lost the match by one wicket, and Dhoni was subsequently ruled out of the series with Kohli being named the captain for the remaining matches.[154] In his second match as captain, Kohli scored his first century as captain, making 102 off 83 balls against the West Indies at Port of Spain in a bonus point win for India.[155][156] Many senior players, including Dhoni, were rested for the five-match ODI tour of Zimbabwe in July 2013, with Kohli being appointed captain for an entire series for the first time.[157] In the first game of the series at Harare, he struck 115 runs from 108 balls, helping India chase down the target of 229 and winning the man of the match award.[158] He batted on two more occasions in the series in which he had scores of 14 and 68*.[46] India completed a 5–0 sweep of the series; their first in an away ODI series."
                }
            ]
        }
        
    ]

    

}